In [10]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
df= pd.read_csv("train.csv",header=None)

In [16]:
df.head()

,0,1,2,3,4,5,6,7,8,9,...,112,113,114,115,116,117,118,119,120,121
0,69769,-946,0.1613,0.7960,Panl,N,Bus2,0.0742,0,2,...,1.0,-4670,0.9851,0.0,0,Mard,0.0,0.3333,0,0
1,236977,-92,NaN,NaN,NaN,Y,Othr,NaN,0,3,...,NaN,-1994,NaN,NaN,0,Mard,0.0,NaN,0,0
2,168821,-1646,0.1124,0.8504,Panl,N,Bus3,0.0387,0,2,...,2.0,-2842,0.9891,0.0,0,Sind,0.0,0.3750,0,1
3,94708,-1651,0.0263,NaN,Blok,N,Bus3,NaN,0,2,...,4.0,-1345,0.9682,0.0,0,Sind,0.0,0.0417,0,1
4,84556,-977,NaN,NaN,NaN,N,Rest,NaN,0,2,...,NaN,-852,NaN,NaN,0,Sind,0.0,NaN,0,0

In [13]:
df.isnull().sum()

0           0
1           0
2      143829
3      163543
4      124975
        ...
117         0
118       811
119    122297
120         0
121         0
Length: 122, dtype: int64

In [14]:
df.shape

(246008, 122)

In [17]:
print(f"n (features): \t{df.shape[1]}")
print(f"m (examples): \t{df.shape[0]}")

n (features): 	122
m (exemplos): 	246008

In [15]:
(df.isnull().sum()/ df.shape[0]).sort_values(ascending=False)

88     0.698396
7      0.698396
17     0.698396
43     0.693998
56     0.693998
         ...
57     0.000000
55     0.000000
53     0.000000
52     0.000000
121    0.000000
Length: 122, dtype: float64

In [18]:
df.dtypes

0        int64
1        int64
2      float64
3      float64
4       object
        ...
117     object
118    float64
119    float64
120      int64
121      int64
Length: 122, dtype: object

In [25]:
NaColumn = df.columns[df.isnull().mean()>=0.05]
df1= df.drop(NaColumn, axis=1)

In [30]:
df1.shape

(246008, 65)

In [53]:
from sklearn.pipeline import Pipeline
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

In [32]:
df1.dtypes

0        int64
1        int64
5       object
6       object
8        int64
        ...
116      int64
117     object
118    float64
120      int64
121      int64
Length: 65, dtype: object

In [33]:
df1.head()

,0,1,5,6,8,9,13,15,16,19,...,104,105,106,108,113,116,117,118,120,121
0,69769,-946,N,Bus2,0,2,180000.0,0,Unad,0,...,1,0,0,0,-4670,0,Mard,0.0,0,0
1,236977,-92,Y,Othr,0,3,135000.0,0,Unad,0,...,1,0,0,0,-1994,0,Mard,0.0,0,0
2,168821,-1646,N,Bus3,0,2,553500.0,0,Spor,0,...,1,0,0,0,-2842,0,Sind,0.0,0,1
3,94708,-1651,N,Bus3,0,2,391500.0,0,Unad,0,...,1,0,0,0,-1345,0,Sind,0.0,0,1
4,84556,-977,N,Rest,0,2,225000.0,0,Unad,0,...,1,0,0,0,-852,0,Sind,0.0,0,0

In [34]:
df1.isnull().sum()

0        0
1        0
5        0
6        0
8        0
      ...
116      0
117      0
118    811
120      0
121      0
Length: 65, dtype: int64

In [36]:
(df1.isnull().sum()/ df1.shape[0]).sort_values(ascending=False)

16     0.004183
35     0.003297
118    0.003297
27     0.003297
72     0.003297
         ...
53     0.000000
55     0.000000
1      0.000000
62     0.000000
121    0.000000
Length: 65, dtype: float64

In [50]:
df1.(16).value_counts() #burda 16.sütüna gidip hangi türde bir veri olduğunu anlamak için bu işlemi yapmak istedim fakat hata aldım

SyntaxError: invalid syntax (Temp/ipykernel_5856/911363968.py, line 1)

In [51]:
#bu kısımda dersteki gibi bir pipeline oluşturmaya çalıştım fakat bütün columnları göremediğimiz için numerical categorical 
#bilmediğimiz için categorical olduğunu düşündüğüm 2 sütun için deneme yaptım. Çalışıyor gözükse de sütunlardaki boşluklar dolmadı
#kontrol etmek için baktığım isnull kısmında 118.kolon hala null gözüküyor.

#features_numerical = ['1', '13', '113']
features_categorical = ['118', '16']
#features_remove = ['Name', 'Cabin', 'Ticket', 'PassengerId']

#numeric_transformer = Pipeline(steps=[
    #('imputer', SimpleImputer(strategy='median')),
    #('scaler', MinMaxScaler())])

categorical_transformer = Pipeline(steps=[
    ('imputer', SimpleImputer(strategy='most_frequent')),
    ('onehot', OneHotEncoder())])

preprocessor = ColumnTransformer(
    transformers=[
        #('Features numerical', numeric_transformer, features_numerical),
        ('Features categorical', categorical_transformer, features_categorical),
        #('Feature para remover', 'drop', features_remove)
])

In [52]:
df1.isnull().sum()

0        0
1        0
5        0
6        0
8        0
      ...
116      0
117      0
118    811
120      0
121      0
Length: 65, dtype: int64